<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,2048,4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_23525_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2" offset="0" size="4" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_23525" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_23524_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 48" offset="4" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_23524" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_23523_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 48" offset="100" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_23523" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_23386_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 48" offset="196" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_23386" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_23385_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 48" offset="292" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_23385" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="396" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="412" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="output" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="output">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/ptb_0/gva/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="420" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/gva/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/ptb_0/gva/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/gva/Unsqueeze_1_output_0,/ptb_0/gva/Unsqueeze_output_0,/ptb_9/gva/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/ptb_0/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/ptb_0/Shape_1_output_0,/ptb_9/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_421" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="388" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_420" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="412" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_422" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="404" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StridedSlice_423" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_424" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="24" name="ReduceProd_425" type="ReduceProd" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_426" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="428" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Concat_427" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/ptb_0/Flatten" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Flatten_output_0,/ptb_9/Flatten_output_0">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/ptb_0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="412" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/ptb_0/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Unsqueeze_output_0,/ptb_9/Unsqueeze_output_0,/tub_9/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/ptb_0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/ptb_0/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Unsqueeze_1_output_0,/ptb_9/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/ptb_0/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Sub_output_0,/ptb_9/Sub_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_23383_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="436" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_23383" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/ptb_0/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Pow_output_0,/ptb_9/Pow_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/ptb_0/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="428" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/ptb_0/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/ReduceSum_output_0,/ptb_9/ReduceSum_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_23384_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="438" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_23384" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/ptb_0/Pow_1" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_0/Pow_1_output_0,/ptb_9/Pow_1_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_4803" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="440" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/ptb_9/TopK" type="TopK" version="opset11">
			<data axis="-1" mode="min" sort="value" index_element_type="i64" stable="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/TopK_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="3" precision="I64" names="/ptb_9/TopK_output_1">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/ptb_0/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="44" name="Constant_24611" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="45" name="Constant_24612" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="46" name="Gather_24613" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/ptb_0/Cast_1_output_0,/ptb_0/Cast_output_0,/ptb_0/Gather_output_0,/ptb_9/Cast_1_output_0,/ptb_9/Cast_output_0,/ptb_9/Gather_output_0,/tub_9/Cast_output_0,/tub_9/Gather_output_0" />
			</output>
		</layer>
		<layer id="47" name="/ptb_0/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="48" name="/ptb_0/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/ptb_0/Range_1_output_0,/ptb_0/Range_output_0,/ptb_9/Range_1_output_0,/ptb_9/Range_output_0,/tub_9/Range_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/ptb_0/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="448" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_9_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/ptb_0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ptb_0/Reshape_3_output_0,/ptb_0/Reshape_output_0,/ptb_9/Reshape_3_output_0,/ptb_9/Reshape_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/ptb_0/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="404" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_413" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="/ptb_0/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/ptb_0/Gather_1_output_0,/ptb_9/Gather_1_output_0,/tub_9/Gather_1_output_0,/tub_9/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/ptb_0/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ptb_0/Mul_output_0,/ptb_9/Mul_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/ptb_9/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ptb_9/Add_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4862" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="/ptb_9/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/ptb_9/Gather_3_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/ptb_0/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="428" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/ptb_0/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_24616" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="412" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_24617" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="61" name="Gather_24618" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/ptb_0/Gather_2_output_0,/ptb_9/Gather_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/ptb_0/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ptb_0/Concat_output_0,/ptb_9/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/ptb_9/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/Reshape_1_output_0">
					<dim>32768</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/ptb_9/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/ptb_9/Shape_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/ptb_9/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ptb_9/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/ptb_9/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>32768</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/Reshape_2_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/ptb_9/gva/delta_mult/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/Sub_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_19109_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 3" offset="472" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Transpose_19109" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/ptb_9/gva/delta_mult/linear_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/linear_1/MatMul_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/ptb_9/gva/delta_mult/linear_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/linear_1/Add_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_4944" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="760" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/ptb_9/gva/delta_mult/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/Transpose_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_20173_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 48, 1, 1" offset="792" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_20173" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Multiply_22549" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_22554_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 48, 1, 1" offset="888" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_22554" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/ptb_9/gva/delta_mult/batch_norm/BatchNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/batch_norm/BatchNormalization_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_4947" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="984" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/ptb_9/gva/delta_mult/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/Transpose_1_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/ptb_9/gva/delta_mult/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/ptb_9/gva/delta_mult/relu/Relu_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Transpose_19116_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 48" offset="1016" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Transpose_19116" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/ptb_9/gva/delta_mult/linear_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/linear_2/MatMul_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/ptb_9/gva/delta_mult/linear_2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ptb_9/gva/delta_mult/linear_2/Add_output_0">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_23518_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 48" offset="5624" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_23518" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_23517_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 48" offset="5720" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_23517" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_23510_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 48" offset="5816" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_23510" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_23509_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 96" offset="5912" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_23509" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_23508_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 96" offset="6104" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_23508" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_23392_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 96" offset="6296" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_23392" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_23391_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 96" offset="6488" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_23391" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_842_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="6680" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="102" name="Constant_842" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="103" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="104" name="Constant_684" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="105" name="/tdb_1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/tdb_1/Gather_8_output_0,/tdb_1/Gather_output_0">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_23387_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3" offset="6682" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_23387" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/tdb_1/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/tdb_1/Div_output_0">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/tdb_1/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/tdb_1/Floor_output_0">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/tdb_1/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/tdb_1/Cast_output_0">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_694" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="/tdb_1/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/tdb_1/Gather_1_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="114" name="Constant_696" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="115" name="/tdb_1/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/tdb_1/Gather_2_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_690" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="388" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/tdb_1/ReduceMax" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/ReduceMax_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_23388" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="404" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/tdb_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Add_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_698" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="121" name="/tdb_1/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/tdb_1/Gather_3_output_0" />
			</output>
		</layer>
		<layer id="122" name="/tdb_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Mul_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/tdb_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Add_1_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="412" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="125" name="Constant_702" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="404" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="126" name="/tdb_1/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/tdb_1/Gather_4_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/tdb_1/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Mul_1_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_705" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="388" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="129" name="/tdb_1/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/tdb_1/Gather_5_output_0" />
			</output>
		</layer>
		<layer id="130" name="/tdb_1/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Mul_2_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/tdb_1/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/tdb_1/Add_2_output_0">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/tdb_1/Unique" type="Unique" version="opset10">
			<data sorted="true" index_element_type="i64" count_element_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>2048</dim>
